app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Thinh123"], ["password_digest", "$2a$10$vG4ooJTMQHQGF68QmnAkd.W2XMUpzckcLjmQTcH.88x8MHzGLM/LS"], ["updated_at", "2015-11-09 16:07:23.983624"]]
---
  def update
    if @user.update_attributes(user_params)